[
    {
        "TLP": "AMBER",
        "Criticality": "HIGH",
        "Threat Type": "Ransomware",
        "Title": "Albabat Ransomware Abuses GitHub for Attacks",
        "Affected Product": ":   Windows, Linux, macOS",
        "CVE": "N/A",
        "Target Sector": ":   Technology & Software Development, Financial Services, Retail & E-Commerce",
        "Region": ":  Global",
        "Executive Summary": ":    The Albabat ransomware group, also known as White Bat, has significantly enhanced its capabilities, now targeting multiple operating systems including Windows, Linux, and macOS. A notable development in their modus operandi is the abuse of GitHub's infrastructure to host encrypted configuration files, which the ransomware retrieves during execution. This strategic shift not only broadens their potential victim pool but also complicates detection and mitigation efforts, underscoring the evolving sophistication of ransomware threats. Technical Details: Initially emerging in 2023, Albabat ransomware primarily targeted Windows systems through deceptive activation tools and cheat software. By early 2024, evidence suggested an expansion to Linux platforms, as indicated by references in the ransomware's dropped desktop wallpapers. Recent analyses have confirmed that versions 2.0.0 and 2.5 possess cross-platform functionalities, capable of gathering system and hardware information from Linux and macOS devices. A critical aspect of Albabat's evolution is its exploitation of GitHub for configuration management. The ransomware accesses its configuration data via the GitHub REST API, using a \"User-Agent\" string labeled \"Awesome App.\" These configurations dictate the ransomware's behavior, specifying directories to exclude from encryption and targeted file extensions. The GitHub repository in question, registered under the name Bill Borguiann, was created in February 2024 and last updated in February 2025. This method of utilizing a legitimate platform like GitHub for malicious purposes complicates traditional detection mechanisms and highlights the need for vigilant monitoring of outbound network traffic.",
        "Threat Profile": ": TACTIC TECHNIQUE ID TECHNIQUE Execution T1204.002 Malicious File Discovery T1082 System Information Discovery Defense Evasion T1140 Deobfuscate/Decode Files or Information Command and Control T1219 Remote Access Software Initial Access T1190 Exploit Public-Facing Application Initial Access T1566 Phishing Impact T1486 Data Encrypted for Impact Lateral Movement T1021.001 Remote Desktop Protocol",
        "Recommendation": ": Access Controls: Implement stringent access controls to restrict unauthorized access to sensitive data and critical systems. System Updates: Regularly update and patch all operating systems and applications to mitigate known vulnerabilities that could be exploited by ransomware. Data Backups: Maintain secure, offline backups of critical data to ensure recovery in the event of an attack. Regularly test backup restoration procedures to verify integrity. Network Segmentation: Segment networks to limit the spread of ransomware and isolate critical systems from potential points of compromise. Monitor Outbound Traffic: Establish monitoring mechanisms for outbound network traffic to detect unauthorized communications with external services like GitHub, which may indicate malicious activity.",
        "Reference": ": https://www.securityweek.com/albabat-ransomware-expands-targets-abuses-github/ https://gbhackers.com/albabat-ransomware-targets-windows-linux-and-macos/ https://otx.alienvault.com/pulse/67dd406ad4fcb1d2da18fd21 https://www.darkreading.com/application-security/oauth-attacks-target-microsoft-365-github",
        "Patch Details": ": Currently, there are no specific patches associated with Albabat ransomware. Organizations should ensure that all systems are up to date with the latest security patches and updates from their respective vendors. --  Aman Pandya Digital Forensics and  Security Operation Center (SOC) Forensic Cyber Tech."
    },
    {
        "TLP": "AMBER",
        "Criticality": "HIGH",
        "Threat Type": "Potential Data Breach",
        "Title": "Alleged Oracle Cloud Data Breach",
        "Affected Product": ":  Oracle Cloud Infrastructure",
        "CVE": "CVE-2021-35587 (unconfirmed)",
        "Target Sector": ":   All sectors utilizing Oracle Cloud services",
        "Region": ":  Global",
        "Executive Summary": ":    On March 21, 2025, reports surfaced alleging a significant security incident involving Oracle Cloud's authentication systems. A threat actor, identified as \"rose87168,\" claimed to have exfiltrated approximately six million records from Oracle Cloud's Single Sign-On (SSO) and Lightweight Directory Access Protocol (LDAP) systems. The purportedly stolen data includes Java Key Store (JKS) files, encrypted SSO passwords, key files, and Enterprise Manager Java Platform Security (JPS) keys. The actor advertised this data for sale on various cybercrime forums, asserting that access was gained by exploiting the login endpoint at login.(region-name). oraclecloud.com . The attacker has been active since January 2025 and is offering to remove the data for a fee, while also seeking assistance in decrypting the compromised information. This incident potentially affects over 140,000 Oracle Cloud tenants, raising concerns about the security of sensitive organizational data.  However, Oracle has officially denied these claims, stating, \"There has been no breach of Oracle Cloud. The published credentials are not for the Oracle Cloud. No Oracle Cloud customers experienced a breach or lost any data.\"",
        "Threat Profile": ": TACTIC TECHNIQUE ID TECHNIQUE Initial Access T1190 Exploit Public-Facing Application Credential Access T1552 Unsecured Credentials",
        "Recommendation": ": Monitor official communications from Oracle for updates regarding the alleged breach. Reset and strengthen passwords, particularly for privileged accounts, and implement multi-factor authentication (MFA) across all user accounts. Review and analyze system logs for any signs of unauthorized access or anomalies.",
        "Reference": ": https://orca.security/resources/blog/oracle-cloud-breach-exploiting-cve-2021-35587/ https://medium.com/%40tahirbalarabe2/oracle-cloud-data-breach-6m-records-compromised-8671a7c32a54 https://www.bleepingcomputer.com/news/security/oracle-denies-data-breach-after-hacker-claims-theft-of-6-million-data-records/ https://www.cloudsek.com/blog/the-biggest-supply-chain-hack-of-2025-6m-records-for-sale-exfiltrated-from-oracle-cloud-affecting-over-140k-tenants",
        "Patch Details": ": While Oracle has denied the breach, organizations should ensure all systems are updated with the latest security patches. Refer to Oracle's official security advisories for guidance. --  Aman Pandya Digital Forensics and  Security Operation Center (SOC) Forensic Cyber Tech."
    },
    {
        "TLP": "AMBER",
        "Criticality": "HIGH",
        "Threat Type": "Local Privilege Escalation",
        "Title": "IBM InfoSphere Information Server Vulnerability",
        "Affected Product": ":   IBM InfoSphere Information Server",
        "CVE": "CVE-2024-51459",
        "Target Sector": ":   Enterprise IT & Cloud Services",
        "Region": ":  Global",
        "Executive Summary": ":    CVE-2024-51459 is a high-severity vulnerability affecting IBM InfoSphere Information Server version 11.7, a widely used data integration and governance platform. This flaw arises from improper handling of user permissions, potentially allowing local attackers to escalate privileges and execute commands with elevated rights. Exploiting this vulnerability could enable adversaries to modify system configurations, exfiltrate sensitive data, install malicious software, or disrupt business operations. Since IBM InfoSphere Information Server is commonly deployed in enterprise environments, the impact of exploitation can be severe, especially for organizations relying on data management solutions for compliance and regulatory requirements. If successfully exploited, attackers could gain persistent access to systems, bypass security restrictions, and move laterally within the affected network. Given its CVSS Base Score of 8.4 (High severity), organizations utilizing vulnerable versions should treat this as a critical risk requiring immediate mitigation. This vulnerability is especially concerning because it enables privilege escalation, allowing attackers to execute malicious activities beyond their authorized user privileges. Once an attacker achieves administrative control over an affected server, they could potentially access business-critical data, override security controls, and establish backdoors for long-term persistence. Given the widespread use of IBM InfoSphere Information Server in finance, healthcare, government, and large enterprises, threat actors could target organizations handling vast amounts of sensitive information, increasing the risk of data breaches and regulatory violations. The risk is exacerbated if the system is exposed to internal threats or if an adversary gains a foothold within the network through social engineering, phishing, or insider threats. If left unpatched, this vulnerability may serve as an entry point for larger-scale cyberattacks, including ransomware deployment, data theft, or business disruption.",
        "Threat Profile": ": TACTIC TECHNIQUE ID TECHNIQUE Privilege Escalation T1068 Exploitation for Privilege Escalation Credential Access T1078 Valid Accounts Defense Evasion T1548 Abuse Elevation Control Mechanism",
        "Recommendation": ": Apply Patches: IBM has released updates to address this vulnerability. Organizations should upgrade to version 11.7.1.136 or later to mitigate the risk. Restrict Local Access: Limit local user access to critical systems and ensure that only authorized personnel have the necessary permissions. Monitor System Activity: Implement monitoring solutions to detect unusual activity that may indicate exploitation attempts.",
        "Reference": ": https://www.ibm.com/support/pages/node/7185056 https://nvd.nist.gov/vuln/detail/CVE-2024-51459 https://www.cvedetails.com/cve/CVE-2024-51459/",
        "Patch Details": ": IBM has released updates to address this vulnerability. Organizations should upgrade to version 11.7.1.136 or later to mitigate the risk. --  Aman Pandya Digital Forensics and  Security Operation Center (SOC) Forensic Cyber Tech."
    },
    {
        "TLP": "AMBER",
        "Criticality": "HIGH",
        "Threat Type": "Unauthorized Access and Information Disclosure",
        "Title": "Cisco Smart Licensing Utility Under Exploitation",
        "Affected Product": ":  Cisco Smart Licensing Utility",
        "CVE": "CVE-2024-20439 CVE-2024-20440",
        "Target Sector": ":  Telecommunications and Networking, Information Technology Services",
        "Region": ":  Global",
        "Executive Summary": ":     In recent weeks, security researchers and organizations have raised alarms about active exploitation of vulnerabilities in Cisco's Smart Licensing Utility (CSLU), a critical component used for managing software licenses across Cisco's extensive product ecosystem. Cisco first disclosed these flaws in September 2024, identifying them as CVE-2024-20439 and CVE-2024-20440. These vulnerabilities have now become a significant target for cybercriminals, prompting urgent security advisories from major cybersecurity institutions. The first vulnerability, CVE-2024-20439, is particularly severe, as it involves an undocumented, hardcoded administrative credential within CSLU. This flaw allows remote, unauthenticated attackers to gain privileged access to affected systems by leveraging the CSLU API, potentially leading to complete system compromise. Exploiting this backdoor-like vulnerability, threat actors can take control of licensing services, manipulate configurations, and escalate their access within an organization's network. The second vulnerability, CVE-2024-20440, enables attackers to retrieve sensitive information, including API credentials, from excessive debugging logs that the CSLU application generates. This flaw allows adversaries to craft specific HTTP requests to extract critical authentication data, which can be used for further network infiltration or lateral movement within the affected environment. The exposure of API keys and credentials significantly increases the risk of unauthorized access and potential data exfiltration. Security analysts have observed instances where attackers chain both vulnerabilities together to maximize impact. By leveraging the exposed credentials from debug logs, attackers can authenticate themselves as privileged users via the hardcoded administrative credential flaw. This combined approach enables persistent access to vulnerable environments and allows threat actors to operate undetected for prolonged periods. Moreover, since CSLU does not run in the background by default, it must be actively initiated by a user for these vulnerabilities to be exploited. However, once attackers gain access, they can establish persistent footholds in compromised systems, deploy additional malware, or pivot to other network segments to escalate their attack. Given that Cisco products are widely deployed across industries such as telecommunications, government, healthcare, and financial services, the potential impact of these vulnerabilities is substantial. Threat intelligence sources indicate that attackers are actively scanning for and targeting internet-facing CSLU instances that remain unpatched. Researchers have also linked some exploitation attempts to advanced persistent threat (APT) groups, suggesting that nation-state actors may be leveraging these vulnerabilities for cyber-espionage campaigns. The severity of this attack has prompted urgent calls for action from the SANS Internet Storm Center and other cybersecurity organizations. Cisco has released patches addressing these flaws, but many organizations have yet to apply them, leaving thousands of systems exposed to potential compromise. Security experts strongly recommend disabling CSLU on systems where it is not actively needed, applying the latest security updates, and implementing strict access controls to prevent unauthorized exploitation. Given the growing threat landscape, organizations using Cisco products should immediately assess their network exposure and take proactive steps to secure their infrastructure before further large-scale attacks occur. The ongoing exploitation of these vulnerabilities highlights the critical need for timely patch management and continuous monitoring of internet-facing enterprise systems.",
        "Threat Profile": ": TACTIC TECHNIQUE ID TECHNIQUE Initial Access T1190 Exploit Public-Facing Application Credential Access T1110.001 Use of Hardcoded Credentials Discovery T1010 Application Window Discovery",
        "Recommendation": ": Immediate Patching: Apply the latest security updates provided by Cisco to remediate these vulnerabilities. Credential Management: Change any default or static credentials associated with the CSLU application and implement strong, unique passwords. Access Controls: Restrict network access to the CSLU application, ensuring it is not exposed to the internet or untrusted networks.",
        "Reference": ": https://vulnera.com/newswire/cisco-addresses-backdoor-admin-account-in-smart-licensing-utility/ https://cyberpress.org/cisco-smart-licensing-attack/ https://www.cybersecuritydive.com/news/cisco-smart-licensing-utility-flaws-attacked/743064/ https://www.bleepingcomputer.com/news/security/cisco-warns-of-backdoor-admin-account-in-smart-licensing-utility/",
        "Patch Details": ": Cisco has released patches addressing these vulnerabilities. Organizations should refer to Cisco's official security advisory for detailed information and apply the necessary updates promptly. --  Aman Pandya Digital Forensics and  Security Operation Center (SOC) Forensic Cyber Tech."
    },
    {
        "TLP": "AMBER",
        "Criticality": "HIGH",
        "Threat Type": "Software Supply Chain Attack",
        "Title": "VSCode Extensions Spreading Ransomware",
        "Affected Product": ":  Visual Studio Code (VSCode) Extensions",
        "CVE": "N/A",
        "Target Sector": ":  Software Development & IT Services, Technology & Startups",
        "Region": ":  Global",
        "Executive Summary": ":     In March 2025, cybersecurity researchers uncovered two malicious extensions in the VSCode Marketplace—\"ahban.shiba\" and \"ahban.cychelloworld\"—designed to deploy early-stage ransomware. These extensions were uploaded on October 27, 2024, and February 17, 2025, respectively, and managed to bypass Microsoft's security review processes, remaining available for several months. Although each extension was downloaded fewer than ten times, their presence exposed critical vulnerabilities in the Marketplace's extension vetting procedures. Upon installation, these extensions executed PowerShell commands that downloaded additional scripts from remote servers. These scripts encrypted files within a specific directory on the victim's desktop, displaying a ransom note demanding payment in cryptocurrency for file recovery. The ransomware's limited functionality suggests it is still under development, but its deployment underscores the potential risks associated with unvetted extensions. This incident highlights the need for enhanced security measures in software extension marketplaces to prevent similar threats in the future.",
        "Threat Profile": ": TACTIC TECHNIQUE ID TECHNIQUE Execution T1204.002 User Execution – Malicious File Execution T1059.001 Command and Scripting Interpreter – PowerShell Initial Access T1190 Exploit Public-Facing Application Impact T1486 Data Encrypted for Impact Command and Control T1105 Ingress Tool Transfer",
        "Recommendation": ": Immediate Action: Uninstall the \"ahban.shiba\" and \"ahban.cychelloworld\" extensions if present. Security Review: Regularly audit installed extensions for suspicious behavior. Marketplace Vigilance: Exercise caution when installing extensions from the VSCode Marketplace, especially those with low download counts or lacking reviews.",
        "Reference": ": https://www.bleepingcomputer.com/news/security/vscode-extensions-with-9-million-installs-pulled-over-security-risks/?&web_view=true https://www.cyber.nj.gov/Home/Components/News/News/1356/214?category=Advisory&npage=5 https://thehackernews.com/2025/03/vscode-marketplace-removes-two.html",
        "Patch Details": ": Currently, there are no specific patches available to address the malicious Visual Studio Code (VSCode) extensions \"ahban.shiba\" and \"ahban.cychelloworld,\" as these extensions have been removed from the VSCode Marketplace. --  Aman Pandya Digital Forensics and  Security Operation Center (SOC) Forensic Cyber Tech."
    }
]